Процедура Тест()
    ТекстЗапроса = "
        // ++ AYS 29.10.2025 Доработка АРМ Неликвиды, чтобы она забирала расположение по ячейкам из WMS - СР--0031437.
        |ВЫБРАТЬ
        |    ВМС_Остатки.Номенклатура КАК Номенклатура,
        |    ВМС_Остатки.Характеристика КАК Характеристика,
        |    ВМС_Остатки.Серия КАК Серия,
        |    ВМС_Остатки.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
        |    ВМС_Остатки.Назначение КАК Назначение,
        |    ВМС_Остатки.КодЯчейкиWMS КАК КодЯчейкиWMS,
        |    ВМС_Остатки.КодПоддонаWMS КАК КодПоддонаWMS,
        |    ВМС_Остатки.IDЯчейкиWMS КАК IDЯчейкиWMS,
        |    ВМС_Остатки.IDПоддонаWMS КАК IDПоддонаWMS,
        |    ВМС_Остатки.Склад КАК Склад,
        |    ВМС_Остатки.Упаковка КАК Упаковка,
        |    ВМС_Остатки.УпаковкаКоэффициент КАК УпаковкаКоэффициент,
        |    ВМС_Остатки.Количество КАК Количество
        |ПОМЕСТИТЬ ОстаткиWMS
        |ИЗ
        |    &ВМС_Остатки КАК ВМС_Остатки
        |
        |;
        |
        |////////////////////////////////////////////////////////////////////////
        // -- AYS 29.10.2025 СР--0031437.
        |ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
        |    ТоварыНаСкладах.Номенклатура КАК Номенклатура,
        |    ТоварыНаСкладах.Склад КАК Склад,
        |    ТоварыНаСкладах.Назначение КАК Назначение,
        |    ТоварыНаСкладах.Серия КАК Серия,
        |    ТоварыНаСкладах.Помещение КАК СкладскоеПомещение,
        |    ТоварыНаСкладах.Характеристика КАК Характеристика,
        |    ТоварыОрганизаций.Организация КАК Организация,
        |    ВЫБОР
        |        КОГДА ТоварыНаСкладах.Помещение.НастройкаАдресногоХранения = ЗНАЧЕНИЕ(Перечисление.НастройкиАдресногоХранения.ЯчейкиОстатки)
        |            ТОГДА 1
        |        ИНАЧЕ 0
        |    КОНЕЦ КАК Приоритет,
        |    (ЕСТЬNULL(ТоварыНаСкладах.ВНаличииОстаток, 0)) КАК ОстаткиПоСкладу,
        |    (ЕСТЬNULL(ТоварыОрганизаций.КоличествоОстаток, 0)) КАК ОстаткиПоУчету,
        |    ТоварыНаСкладах.Номенклатура.ЕдиницаИзмерения КАК ЕдИзмОстаткиПоСкладу,
        // ++ AYS 29.10.2025 Доработка АРМ Неликвиды, чтобы она забирала расположение по ячейкам из WMS - СР--0031437.
        |    ВЫБОР
        |        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        |                И ЕСТЬNULL(ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка), ИСТИНА)
        |              ТОГДА ТоварыВЯчейках.Упаковка
        |       ИНАЧЕ ОстаткиWMS.Упаковка
        |    КОНЕЦ КАК Упаковка,
        |    ВЫБОР
        |        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        |                И ЕСТЬNULL(ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка), ИСТИНА)
        |              ТОГДА ТоварыВЯчейках.Ячейка
        |       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.КодЯчейкиWMS, """")
        |    КОНЕЦ КАК АдресЯчейки,
        |   ВЫБОР
        |        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        |                И ЕСТЬNULL(ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка), ИСТИНА)
        |              ТОГДА """"
        |       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.КодПоддонаWMS, """")
        |    КОНЕЦ КАК АдресПоддона,
        |   (ВЫБОР
        |        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        |                И ЕСТЬNULL(ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка), ИСТИНА)
        |              ТОГДА ЕСТЬNULL(ТоварыВЯчейках.ВНаличииОстаток, 0)
        |       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.Количество, 0) / ЕСТЬNULL(ВЫБОР КОГДА ОстаткиWMS.УпаковкаКоэффициент = 0 ТОГДА 1 ИНАЧЕ ОстаткиWMS.УпаковкаКоэффициент КОНЕЦ, 1)
        |    КОНЕЦ) КАК ОстаткиПоЯчейкам,
        |   (ВЫБОР
        |        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        |                И ЕСТЬNULL(ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка), ИСТИНА)
        |              ТОГДА ЕСТЬNULL(ТоварыВЯчейках.ВНаличииОстаток * ЕСТЬNULL(ТоварыВЯчейках.Упаковка.Числитель, 1), 0)
        |       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.Количество, 0)
        |    КОНЕЦ) КАК ОстаткиПоЯчейкамВЕдИзм
        // -- AYS 29.10.2025 СР--0031437.
        |ИЗ
        |    РегистрНакопления.ТоварыНаСкладах.Остатки(
        |            ,
        |            НЕ Номенклатура В
        |                        (ВЫБРАТЬ
        |                            НоменклатураНеДляПродажиНаПТ.Номенклатура КАК Номенклатура
        |                        ИЗ
        |                            РегистрСведений.НоменклатураНеДляПродажиНаПТ КАК НоменклатураНеДляПродажиНаПТ)
        |                И Склад В (&СписокСкладов)
        |                И ВЫБОР
        |                    КОГДА Назначение.НазначениеНаПроверке <> ЗНАЧЕНИЕ(Справочник.Назначения.ПустаяСсылка)
        |                            ИЛИ Назначение = &НаПроверке
        |                        ТОГДА ЛОЖЬ
        |                    ИНАЧЕ ИСТИНА
        |                КОНЕЦ
        |                И ВЫБОР
        |                    КОГДА НЕ Назначение.Ссылка ЕСТЬ NULL
        |                        ТОГДА ВЫБОР
        |                                КОГДА НЕ Назначение.Договор.Ссылка ЕСТЬ NULL
        |                                    ТОГДА НЕ Назначение.Договор.ТипДоговора В (&СписокИсключений)
        |                                ИНАЧЕ ИСТИНА
        |                            КОНЕЦ
        |                    ИНАЧЕ ИСТИНА
        |                КОНЕЦ
        |                И Номенклатура.Качество = ЗНАЧЕНИЕ(Перечисление.ГрадацииКачества.Новый)
        |                И Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
        |                И Серия <> ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
        |                И Серия.ГоденДо <> ДАТАВРЕМЯ(1, 1, 1)
        |                И Серия.ГоденДо <> ДАТАВРЕМЯ(1980, 1, 1)
        |                И Номенклатура.ВидНоменклатуры В (&ВидыНоменклатуры)) КАК ТоварыНаСкладах
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыОрганизаций.Остатки(, Организация = &Организация) КАК ТоварыОрганизаций
        |        ПО ТоварыНаСкладах.Номенклатура = ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Номенклатура
        |            И ТоварыНаСкладах.Склад = ТоварыОрганизаций.АналитикаУчетаНоменклатуры.СкладскаяТерритория
        |            И (ВЫБОР
        |                КОГДА ТоварыНаСкладах.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыСырьеПП)
        |                    ТОГДА ИСТИНА
        |                ИНАЧЕ ТоварыНаСкладах.Серия = ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Серия
        |            КОНЕЦ)
        |            И ТоварыНаСкладах.Характеристика = ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Характеристика
        |            И ТоварыНаСкладах.Назначение = ТоварыОрганизаций.АналитикаУчетаНоменклатуры.Назначение
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВЯчейках.Остатки(, ) КАК ТоварыВЯчейках
        |        ПО ТоварыНаСкладах.Номенклатура = ТоварыВЯчейках.Номенклатура
        |            И ТоварыНаСкладах.Характеристика = ТоварыВЯчейках.Характеристика
        |            И ТоварыНаСкладах.Серия = ТоварыВЯчейках.Серия
        |            И ТоварыНаСкладах.Назначение = ТоварыВЯчейках.Назначение
        |            И ТоварыНаСкладах.Склад = ТоварыВЯчейках.Ячейка.Владелец
        |            И ТоварыНаСкладах.Помещение = ТоварыВЯчейках.Ячейка.Помещение
        // ++ AYS 29.10.2025 Доработка АРМ Неликвиды, чтобы она забирала расположение по ячейкам из WMS - СР--0031437.
        |        ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиWMS КАК ОстаткиWMS
        |        ПО ТоварыНаСкладах.Номенклатура = ОстаткиWMS.Номенклатура
        |            И ТоварыНаСкладах.Характеристика = ОстаткиWMS.Характеристика
        |            И ТоварыНаСкладах.Серия = ОстаткиWMS.Серия
        |            И ТоварыНаСкладах.Назначение = ОстаткиWMS.Назначение
        |            И (ТоварыНаСкладах.Склад = ОстаткиWMS.Склад)
        // -- AYS 29.10.2025 СР--0031437.
        |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИсторияСертификации.СрезПоследних(, ) КАК ИсторияСертификации
        |        ПО ТоварыНаСкладах.Серия = ИсторияСертификации.Серия
        |            И (ИсторияСертификации.Результат)
        |ГДЕ
        |    ТоварыНаСкладах.КОтгрузкеОстаток = 0
        |    И ВЫБОР
        |            КОГДА ТоварыНаСкладах.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыСырьеПП)
        |                ТОГДА ВЫБОР
        |                        КОГДА НЕ ИсторияСертификации.Серия ЕСТЬ NULL
        |                                И ИсторияСертификации.СрокСертификата <> ДАТАВРЕМЯ(1, 1, 1)
        |                                И ИсторияСертификации.СрокСертификата <> ДАТАВРЕМЯ(1980, 1, 1) ТОГДА
        |                                  ИсторияСертификации.СрокСертификата <= &НаДату
        |                        ИНАЧЕ
        |                                  ТоварыНаСкладах.Серия.ГоденДо <= &НаДату
        |                        КОНЕЦ
        |            ИНАЧЕ ТоварыНаСкладах.Серия.ГоденДо <= &НаДату
        |      КОНЕЦ
        // временно отключаем доработку по просьбе аналитика
        // ++ NIA 23.10.2024 Не переводить в неликвиды, если вид запасов Товар на хранении - СР--0026848.
        // если вид номенклатуры Продукция и тип запасов, указанный в регистре Товары организации, имеет значение Товары на хранении с правом перепродажи
        // тогда таким номенклатурным позициям не даем возможность перевода в неликвид
        //|   И ВЫБОР
        //|             КОГДА ТоварыНаСкладах.Номенклатура.ВидНоменклатуры В (&ВидыНоменклатурыПродукция)
        //|                 И НЕ ТоварыОрганизаций.ВидЗапасов.ТипЗапасов ЕСТЬ NULL
        //|                   ТОГДА ТоварыОрганизаций.ВидЗапасов.ТипЗапасов <> ЗНАЧЕНИЕ(Перечисление.ТипыЗапасов.ТоварНаХраненииСПравомПродажи)
        //|             ИНАЧЕ ИСТИНА
        //|     КОНЕЦ
        // -- NIA 23.10.2024 СР--0026848.
        |
        // ++ AYS 10.12.2025 Добавить привязку в запросах ячейка - склад - СР--0031981.
        //|СГРУППИРОВАТЬ ПО
        //|    ТоварыНаСкладах.Номенклатура,
        //|    ТоварыНаСкладах.Серия,
        //|    ТоварыНаСкладах.Помещение,
        //|    ВЫБОР
        //|        КОГДА ТоварыНаСкладах.Помещение.НастройкаАдресногоХранения = ЗНАЧЕНИЕ(Перечисление.НастройкиАдресногоХранения.ЯчейкиОстатки)
        //|            ТОГДА 1
        //|        ИНАЧЕ 0
        //|    КОНЕЦ,
        //|    ТоварыНаСкладах.Характеристика,
        //|    ТоварыНаСкладах.Назначение,
        //|    ТоварыНаСкладах.Склад,
        //// ++ AYS 29.10.2025 Доработка АРМ Неликвиды, чтобы она забирала расположение по ячейкам из WMS - СР--0031437.
        //|    ВЫБОР
        //|        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|                И ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|              ТОГДА ТоварыВЯчейках.Упаковка
        //|       ИНАЧЕ ОстаткиWMS.Упаковка
        //|    КОНЕЦ,
        //|    ВЫБОР
        //|        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|                И ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|              ТОГДА ТоварыВЯчейках.Ячейка
        //|       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.КодЯчейкиWMS, """")
        //|    КОНЕЦ,
        //|   ВЫБОР
        //|        КОГДА ТоварыНаСкладах.Склад.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|                И ТоварыНаСкладах.Помещение.ЗонаWMS = ЗНАЧЕНИЕ(Справочник.СкладскиеЗоныВWMS.ПустаяСсылка)
        //|              ТОГДА """"
        //|       ИНАЧЕ ЕСТЬNULL(ОстаткиWMS.КодПоддонаWMS, """")
        //|    КОНЕЦ,
        //// -- AYS 29.10.2025 СР--0031437.
        //|    ТоварыОрганизаций.Организация,
        //|    ТоварыНаСкладах.Номенклатура.ЕдиницаИзмерения
        // -- AYS 10.12.2025 СР--0031981.
        |
        |УПОРЯДОЧИТЬ ПО
        |    Приоритет УБЫВ,
        |    Номенклатура,
        |    Характеристика,
        |    Серия УБЫВ
        |ИТОГИ
        |    СУММА(ОстаткиПоСкладу),
        |    СУММА(ОстаткиПоУчету),
        |    СУММА(ОстаткиПоЯчейкамВЕдИзм)
        |ПО
        |    Номенклатура,
        |    Склад,
        |    Назначение,
        |    Характеристика,
        |    Серия,
        |    СкладскоеПомещение";
КонецПроцедуры